# Creating a clean database

In [1]:
import pandas as pd

travel_trip_data = "../data/raw/Travel details dataset.csv"
travel_trip_full_df = pd.read_csv(travel_trip_data, encoding='ISO-8859-1')
travel_trip_full_df.head(10)

,ï»¿Trip ID,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
1,2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
2,3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
3,4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
4,5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200
5,6,"Paris, France",10/5/2023,10/10/2023,5.0,Michael Brown,42.0,Male,American,Hotel,1500,Flight,800
6,7,"Sydney, Australia",11/20/2023,11/30/2023,10.0,Emily Davis,33.0,Female,Australian,Hostel,500,Flight,1200
7,8,"Rio de Janeiro, Brazil",1/5/2024,1/12/2024,7.0,Lucas Santos,25.0,Male,Brazilian,Airbnb,900,Flight,600
8,9,"Amsterdam, Netherlands",2/14/2024,2/21/2024,7.0,Laura Janssen,31.0,Female,Dutch,Hotel,1200,Train,200
9,10,"Dubai, United Arab Emirates",3/10/2024,3/17/2024,7.0,Mohammed Ali,39.0,Male,Emirati,Resort,2500,Flight,800

## Christos code

### Cleaning column names

In [2]:
travel_trip_full_df.columns = travel_trip_full_df.columns.str.replace("ï»¿", "", regex=False).str.replace(r"[()]", "", regex=True).str.strip(")").str.replace(" ","_").str.lower()
travel_trip_full_df.columns

Index(['trip_id', 'destination', 'start_date', 'end_date', 'duration_days',
       'traveler_name', 'traveler_age', 'traveler_gender',
       'traveler_nationality', 'accommodation_type', 'accommodation_cost',
       'transportation_type', 'transportation_cost'],
      dtype='object')

### Cleaning destination

In [3]:
# I want to take the column destination, and rather split it in two, destination_city and destination_country

# Split on the first comma into two columns
travel_trip_full_df[["destination_city", "destination_country"]] = (
    travel_trip_full_df["destination"]
        .str.split(",", n=1, expand=True)
)

# Clean up whitespace
travel_trip_full_df["destination_city"] = (
    travel_trip_full_df["destination_city"].str.strip()
)
travel_trip_full_df["destination_country"] = (
    travel_trip_full_df["destination_country"].str.strip()
)

travel_trip_full_df

,trip_id,destination,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost,destination_city,destination_country
0,1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600,London,UK
1,2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500,Phuket,Thailand
2,3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700,Bali,Indonesia
3,4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000,New York,USA
4,5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200,Tokyo,Japan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,135,"Rio de Janeiro, Brazil",8/1/2023,8/10/2023,9.0,Jose Perez,37.0,Male,Brazilian,Hostel,2500,Car,2000,Rio de Janeiro,Brazil
135,136,"Vancouver, Canada",8/15/2023,8/21/2023,6.0,Emma Wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000,Vancouver,Canada
136,137,"Bangkok, Thailand",9/1/2023,9/8/2023,7.0,Ryan Chen,34.0,Male,Chinese,Hostel,2000,Train,1000,Bangkok,Thailand
137,138,"Barcelona, Spain",9/15/2023,9/22/2023,7.0,Sofia Rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500,Barcelona,Spain
138,139,"Auckland, New Zealand",10/1/2023,10/8/2023,7.0,William Brown,39.0,Male,New Zealander,Hotel,7000,Train,2500,Auckland,New Zealand

In [4]:
# will however first move the two new columns on the right and next to destination
cols = list(travel_trip_full_df.columns)
cols.insert(cols.index("destination") + 1, cols.pop(cols.index("destination_city")))
travel_trip_full_df = travel_trip_full_df.loc[:, cols]

cols = list(travel_trip_full_df.columns)
cols.insert(cols.index("destination_city") - 1, cols.pop(cols.index("destination_country")))
travel_trip_full_df = travel_trip_full_df.loc[:, cols]

cols = list(travel_trip_full_df.columns)
cols.insert(cols.index("destination_country") - 1, cols.pop(cols.index("destination")))
travel_trip_full_df = travel_trip_full_df.loc[:, cols]

travel_trip_full_df

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,"London, UK",1,UK,London,5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
1,"Phuket, Thailand",2,Thailand,Phuket,6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
2,"Bali, Indonesia",3,Indonesia,Bali,7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
3,"New York, USA",4,USA,New York,8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
4,"Tokyo, Japan",5,Japan,Tokyo,9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,8/1/2023,8/10/2023,9.0,Jose Perez,37.0,Male,Brazilian,Hostel,2500,Car,2000
135,"Vancouver, Canada",136,Canada,Vancouver,8/15/2023,8/21/2023,6.0,Emma Wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000
136,"Bangkok, Thailand",137,Thailand,Bangkok,9/1/2023,9/8/2023,7.0,Ryan Chen,34.0,Male,Chinese,Hostel,2000,Train,1000
137,"Barcelona, Spain",138,Spain,Barcelona,9/15/2023,9/22/2023,7.0,Sofia Rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500
138,"Auckland, New Zealand",139,New Zealand,Auckland,10/1/2023,10/8/2023,7.0,William Brown,39.0,Male,New Zealander,Hotel,7000,Train,2500

### Searching for NaN values

In [5]:
travel_trip_full_df.isnull().sum()

destination              2
trip_id                  0
destination_country     68
destination_city         2
start_date               2
end_date                 2
duration_days            2
traveler_name            2
traveler_age             2
traveler_gender          2
traveler_nationality     2
accommodation_type       2
accommodation_cost       2
transportation_type      3
transportation_cost      3
dtype: int64

In [6]:
# checking the destinatio column to see what destination_city has so many NaN values. 
# It shows that for many rows we only have information about the city. 
# That's no problem, we can easily extrapolate the country frrom it.
travel_trip_full_df.destination.unique()

array(['London, UK', 'Phuket, Thailand', 'Bali, Indonesia',
       'New York, USA', 'Tokyo, Japan', 'Paris, France',
       'Sydney, Australia', 'Rio de Janeiro, Brazil',
       'Amsterdam, Netherlands', 'Dubai, United Arab Emirates',
       'Cancun, Mexico', 'Barcelona, Spain', 'Honolulu, Hawaii',
       'Berlin, Germany', 'Marrakech, Morocco', 'Edinburgh, Scotland',
       'Paris', 'Bali', 'London', 'Tokyo', 'New York', 'Sydney', 'Rome',
       'Bangkok', 'Hawaii', 'Barcelona', 'Japan', 'Thailand', 'France',
       'Australia', 'Brazil', 'Greece', 'Egypt', 'Mexico', 'Italy',
       'Spain', 'Canada', 'New York City, USA', 'Bangkok, Thailand',
       'Vancouver, Canada', 'Sydney, AUS', 'Seoul, South Korea',
       'Los Angeles, USA', 'Rome, Italy', 'Cape Town', nan,
       'Cape Town, SA', 'Sydney, Aus', 'Bangkok, Thai', 'Phuket, Thai',
       'Dubai', 'Seoul', 'Rio de Janeiro', 'Amsterdam', 'Phuket',
       'Santorini', 'Phnom Penh', 'Athens, Greece',
       'Cape Town, South Africa', 'Auckland, New Zealand'], dtype=object)

In [7]:
# we can immediately identify that most columns have 2 NaN values. Will do a test to check whether those values are in the same rows

assumption_columns = [
    "destination",
    "destination_city",
    "start_date",
    "end_date",
    "duration_days",
    "traveler_name",
    "traveler_age",
    "traveler_gender",
    "traveler_nationality",
    "accommodation_type",
    "accommodation_cost"
]

all_null_test = travel_trip_full_df[assumption_columns].isna().all(axis=1)
all_null_count = all_null_test.sum()
print(all_null_count)

2

In [8]:
# our assumption is true, those two rows are fully empty and we can drop them
travel_trip_full_df = travel_trip_full_df.dropna(thresh=2)

### Checking for duplicates

In [9]:
travel_trip_full_df.duplicated().sum()

np.int64(0)

In [10]:
travel_trip_full_df.traveler_name.duplicated().sum()

np.int64(28)

In [11]:
travel_trip_full_df.traveler_name.unique()

array(['John Smith', 'Jane Doe', 'David Lee', 'Sarah Johnson',
       'Kim Nguyen', 'Michael Brown', 'Emily Davis', 'Lucas Santos',
       'Laura Janssen', 'Mohammed Ali', 'Ana Hernandez', 'Carlos Garcia',
       'Lily Wong', 'Hans Mueller', 'Fatima Khouri', 'James MacKenzie',
       'Michael Chang', 'Olivia Rodriguez', 'Kenji Nakamura', 'Emily Lee',
       'James Wilson', 'Sofia Russo', 'Raj Patel', 'Lily Nguyen',
       'David Kim', 'Maria Garcia', 'Alice Smith', 'Bob Johnson',
       'Charlie Lee', 'Emma Davis', 'Olivia Martin', 'Harry Wilson',
       'Sophia Lee', 'James Brown', 'Mia Johnson', 'William Davis',
       'Amelia Brown', 'Adam Lee', 'Sarah Wong', 'Maria Silva',
       'Peter Brown', 'Emma Garcia', 'Michael Davis', 'Nina Patel',
       'Kevin Kim', 'Laura van den Berg', 'Jennifer Nguyen', 'Rachel Lee',
       'Jessica Wong', 'Felipe Almeida', 'Nisa Patel', 'Ben Smith',
       'Laura Gomez', 'Park Min Woo', 'Michael Chen', 'Sofia Rossi',
       'Rachel Sanders', 'Emily Watson', 'Ana Rodriguez', 'Tom Wilson',
       'Olivia Green', 'James Chen', 'Lila Patel', 'Marco Rossi',
       'Sarah Brown', 'Sarah Lee', 'Alex Kim', 'Maria Hernandez',
       'Mark Johnson', 'Amanda Chen', 'Nana Kwon', 'Tom Hanks',
       'Emma Watson', 'James Kim', 'Fatima Ahmed', 'Liam Nguyen',
       'Giulia Rossi', 'Putra Wijaya', 'Kim Min-ji', 'Emily Johnson',
       'Michael Wong', 'Jessica Chen', 'Ken Tanaka', 'Rodrigo Oliveira',
       'Olivia Kim', 'Robert Mueller', 'Lisa Chen', 'Emily Wong',
       'Mark Tan', 'Emma Lee', 'George Chen', 'Sophia Kim', 'Alex Ng',
       'Cindy Chen', 'Emily Kim', 'Frank Li', 'Gina Lee', 'Henry Kim',
       'Isabella Chen', 'Jack Smith', 'Katie Johnson', 'John Doe',
       'Jane Smith', 'Michael Johnson', 'Jose Perez', 'Emma Wilson',
       'Ryan Chen', 'Sofia Rodriguez', 'William Brown'], dtype=object)

In [12]:
# I will make sure that the column traveler_name is lowercased and stripped from double spaces or dashes, just in case this might hide more duplicates
# ideally, when you created travel_trip_christos_df, you already did:
# travel_trip_christos_df = original_df[...].copy()

travel_trip_full_df.loc[:, "traveler_name"] = (
    travel_trip_full_df["traveler_name"]
        .str.strip()                        # trims whitespace at both ends
        .str.replace("-", " ", regex=False) # replace hyphen with space
        .str.lower()
)
travel_trip_full_df.traveler_name.unique()

array(['john smith', 'jane doe', 'david lee', 'sarah johnson',
       'kim nguyen', 'michael brown', 'emily davis', 'lucas santos',
       'laura janssen', 'mohammed ali', 'ana hernandez', 'carlos garcia',
       'lily wong', 'hans mueller', 'fatima khouri', 'james mackenzie',
       'michael chang', 'olivia rodriguez', 'kenji nakamura', 'emily lee',
       'james wilson', 'sofia russo', 'raj patel', 'lily nguyen',
       'david kim', 'maria garcia', 'alice smith', 'bob johnson',
       'charlie lee', 'emma davis', 'olivia martin', 'harry wilson',
       'sophia lee', 'james brown', 'mia johnson', 'william davis',
       'amelia brown', 'adam lee', 'sarah wong', 'maria silva',
       'peter brown', 'emma garcia', 'michael davis', 'nina patel',
       'kevin kim', 'laura van den berg', 'jennifer nguyen', 'rachel lee',
       'jessica wong', 'felipe almeida', 'nisa patel', 'ben smith',
       'laura gomez', 'park min woo', 'michael chen', 'sofia rossi',
       'rachel sanders', 'emily watson', 'ana rodriguez', 'tom wilson',
       'olivia green', 'james chen', 'lila patel', 'marco rossi',
       'sarah brown', 'sarah lee', 'alex kim', 'maria hernandez',
       'mark johnson', 'amanda chen', 'nana kwon', 'tom hanks',
       'emma watson', 'james kim', 'fatima ahmed', 'liam nguyen',
       'giulia rossi', 'putra wijaya', 'kim min ji', 'emily johnson',
       'michael wong', 'jessica chen', 'ken tanaka', 'rodrigo oliveira',
       'olivia kim', 'robert mueller', 'lisa chen', 'emily wong',
       'mark tan', 'emma lee', 'george chen', 'sophia kim', 'alex ng',
       'cindy chen', 'emily kim', 'frank li', 'gina lee', 'henry kim',
       'isabella chen', 'jack smith', 'katie johnson', 'john doe',
       'jane smith', 'michael johnson', 'jose perez', 'emma wilson',
       'ryan chen', 'sofia rodriguez', 'william brown'], dtype=object)

In [13]:
travel_trip_full_df.traveler_name.duplicated().sum()

np.int64(28)

In [14]:
# we can see that there are no exact full string duplicates of the column traveler_name. 
# The number 28 above probalby comes from partial dupication, like only first name or only last name

### More NaN values

In [15]:
travel_trip_full_df.isnull().sum()

destination              0
trip_id                  0
destination_country     66
destination_city         0
start_date               0
end_date                 0
duration_days            0
traveler_name            0
traveler_age             0
traveler_gender          0
traveler_nationality     0
accommodation_type       0
accommodation_cost       0
transportation_type      1
transportation_cost      1
dtype: int64

In [16]:
# let's find out the NaN values in 
mask = travel_trip_full_df["transportation_type"].isna() & \
       travel_trip_full_df["transportation_cost"].isna()

travel_trip_full_df[mask]

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
82,"Rome, Italy",83,Italy,Rome,4/15/2025,4/22/2025,7.0,james kim,41.0,Male,American,Hotel,100,NaN,NaN

In [17]:
# for transportation type and transportation_cost NaN values, we will group by destination_city and calculate the count of transportation_type and mean transportation_cost, and filter for Rome.

# we will need to cast the data type of the column transportation_cost to float, before we can proceed with grouping.

# for this to happen we will need to clean the column transportation_cost

In [18]:
travel_trip_full_df.dtypes

destination              object
trip_id                   int64
destination_country      object
destination_city         object
start_date               object
end_date                 object
duration_days           float64
traveler_name            object
traveler_age            float64
traveler_gender          object
traveler_nationality     object
accommodation_type       object
accommodation_cost       object
transportation_type      object
transportation_cost      object
dtype: object

In [19]:
travel_trip_full_df.transportation_cost.unique()

array(['600', '500', '700', '1000', '200', '800', '1200', '100', '400',
       '150', '$400 ', '$700 ', '$150 ', '$800 ', '$100 ', '$600 ',
       '$80 ', '$500 ', '$300 ', '$50 ', '$120 ', '$75 ', '900', '50',
       '$200 ', '$250 ', '$20 ', '300', '800 USD', '200 USD', '500 USD',
       '700 USD', '300 USD', '600 USD', '400 USD', '1000 USD', nan,
       '100 USD', '350 USD', '150 USD', '$1,200 ', '$900 ', '$1,500 ',
       '$1,000 ', '250', '2500', '1500', '2000', '3000'], dtype=object)

In [20]:
# we will need to remove anything but the numbers
travel_trip_full_df.loc[:, "transportation_cost"] = (
    travel_trip_full_df["transportation_cost"]
        .astype(str)                      # in case there are numbers/NaN in there
        .str.strip()
        .str.strip("$")
        .str.replace(",", "", regex=False)
        .str.replace(" USD", "", regex=False)
        .str.strip()
)

travel_trip_full_df.loc[:, "transportation_cost"] = pd.to_numeric(
    travel_trip_full_df["transportation_cost"],
    errors="coerce"
)

travel_trip_full_df.transportation_cost.unique()

array([600.0, 500.0, 700.0, 1000.0, 200.0, 800.0, 1200.0, 100.0, 400.0,
       150.0, 80.0, 300.0, 50.0, 120.0, 75.0, 900.0, 250.0, 20.0, nan,
       350.0, 1500.0, 2500.0, 2000.0, 3000.0], dtype=object)

In [21]:
# now we cast, in order to be able to group later

travel_trip_full_df.loc[:, "transportation_cost"] = (
    travel_trip_full_df["transportation_cost"].astype("float64")
)

travel_trip_full_df.dtypes

destination              object
trip_id                   int64
destination_country      object
destination_city         object
start_date               object
end_date                 object
duration_days           float64
traveler_name            object
traveler_age            float64
traveler_gender          object
traveler_nationality     object
accommodation_type       object
accommodation_cost       object
transportation_type      object
transportation_cost      object
dtype: object

In [22]:
# for transportation type and transportation_cost NaN values, we will group by destination_city and calculate the count of transportation_type and mean transportation_cost, and filter for Rome.

grouped_df = (travel_trip_full_df.groupby(["destination_city", "transportation_type"]).agg(transportation_type_count = ("transportation_type", "count"), transportation_cost_mean = ("transportation_cost", "mean")))
filtered_grouped_df = grouped_df.loc[["Rome"]]
filtered_grouped_df

                                      transportation_type_count  \
destination_city transportation_type
Rome             Plane                                        2
                 Train                                        6

                                     transportation_cost_mean
destination_city transportation_type
Rome             Plane                                  625.0
                 Train                                  405.0

In [23]:
# therefore, we will fill the empty values transportation_type with "Train", and transportation_cost with "405.0"
travel_trip_full_df.loc[:, "transportation_type"] = (
    travel_trip_full_df["transportation_type"].fillna("Train")
)

travel_trip_full_df.transportation_type.isnull().sum()

np.int64(0)

In [24]:
# now let's replace the NaN, with the mean value.
travel_trip_full_df.loc[:, "transportation_cost"] = (
    travel_trip_full_df["transportation_cost"].fillna(405.0)
)

travel_trip_full_df.transportation_cost.isnull().sum()

/var/folders/13/s00136yd6q5bvv6x74_x_m204g4004/T/ipykernel_39449/1427628029.py:3: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  travel_trip_full_df["transportation_cost"].fillna(405.0)

np.int64(0)

In [25]:
travel_trip_full_df

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,"London, UK",1,UK,London,5/1/2023,5/8/2023,7.0,john smith,35.0,Male,American,Hotel,1200,Flight,600.0
1,"Phuket, Thailand",2,Thailand,Phuket,6/15/2023,6/20/2023,5.0,jane doe,28.0,Female,Canadian,Resort,800,Flight,500.0
2,"Bali, Indonesia",3,Indonesia,Bali,7/1/2023,7/8/2023,7.0,david lee,45.0,Male,Korean,Villa,1000,Flight,700.0
3,"New York, USA",4,USA,New York,8/15/2023,8/29/2023,14.0,sarah johnson,29.0,Female,British,Hotel,2000,Flight,1000.0
4,"Tokyo, Japan",5,Japan,Tokyo,9/10/2023,9/17/2023,7.0,kim nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,8/1/2023,8/10/2023,9.0,jose perez,37.0,Male,Brazilian,Hostel,2500,Car,2000.0
135,"Vancouver, Canada",136,Canada,Vancouver,8/15/2023,8/21/2023,6.0,emma wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000.0
136,"Bangkok, Thailand",137,Thailand,Bangkok,9/1/2023,9/8/2023,7.0,ryan chen,34.0,Male,Chinese,Hostel,2000,Train,1000.0
137,"Barcelona, Spain",138,Spain,Barcelona,9/15/2023,9/22/2023,7.0,sofia rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500.0
138,"Auckland, New Zealand",139,New Zealand,Auckland,10/1/2023,10/8/2023,7.0,william brown,39.0,Male,New Zealander,Hotel,7000,Train,2500.0

### Checking if we need to cluster vlues together

In [26]:
# let's quickly check the transportation_types

travel_trip_full_df.transportation_type.unique()

array(['Flight', 'Train', 'Plane', 'Bus', 'Car rental', 'Subway', 'Car',
       'Ferry', 'Airplane'], dtype=object)

In [27]:
# do we need to also change "Subway" to train? Maybe, who travels to a city using a subway, subways are intra city transportation modes.
subway_df = travel_trip_full_df.groupby("transportation_type").agg(transportation_type_count = ("transportation_type", "count"), transportation_cost_mean = ("transportation_cost", "mean"))
filtered_subway_df = subway_df.loc[["Subway", "Train"]]
filtered_subway_df

                     transportation_type_count transportation_cost_mean
transportation_type
Subway                                       1                     20.0
Train                                       38               346.184211

In [28]:
# Subway seems to be an outlier data, but let's check at least if the transportation_cost of the "Subway" is at least close to the minimum cost for "Train"
subway_df = travel_trip_full_df.groupby("transportation_type").agg(transportation_type_count = ("transportation_type", "count"), transportation_cost_min = ("transportation_cost", "min"))
filtered_subway_min_df = subway_df.loc[["Subway", "Train"]]
filtered_subway_min_df

                     transportation_type_count transportation_cost_min
transportation_type
Subway                                       1                    20.0
Train                                       38                    80.0

In [29]:
# this is not the case, therefore, we will exclude it from our calculations of "Train"

In [30]:
# and "Car" and "Car rental" under "Car"?
car_df = travel_trip_full_df.groupby("transportation_type").agg(transportation_type_count = ("transportation_type", "count"), transportation_cost_mean = ("transportation_cost", "mean"))
filtered_car_df = car_df.loc[["Car rental", "Car"]]
filtered_car_df

                     transportation_type_count transportation_cost_mean
transportation_type
Car rental                                  13               296.153846
Car                                          3              1433.333333

In [31]:
# no, we see that there is a massive difference in the mean cost between the two categories, suggesting that it is indeed two different transportation modes. 
# Car rental suggests that someone rented a car at the destnation, where car probably indicates that someone did a road trip using a car to destination.

In [32]:
# ok, we will merge "Plane" and "Airplane" under "Airplane", and "Car rental" to "Rental Car", and "Car" to "Private Car"
travel_trip_full_df.loc[:, "transportation_type"] = (
    travel_trip_full_df["transportation_type"]
        .replace({"Plane": "Airplane"})
)

travel_trip_full_df.loc[:, "transportation_type"] = (
    travel_trip_full_df["transportation_type"]
        .replace({"Car rental": "Rental Car"})
)

travel_trip_full_df.loc[:, "transportation_type"] = (
    travel_trip_full_df["transportation_type"]
        .replace({"Car": "Private Car"})
)

travel_trip_full_df["transportation_type"].unique()

array(['Flight', 'Train', 'Airplane', 'Bus', 'Rental Car', 'Subway',
       'Private Car', 'Ferry'], dtype=object)

In [33]:
travel_trip_full_df.tail(15)

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
123,"Tokyo, Japan",124,Japan,Tokyo,10/5/2022,10/13/2022,8.0,henry kim,24.0,Male,Korean,Hotel,1200,Airplane,700.0
124,"Sydney, Aus",125,Aus,Sydney,11/11/2022,11/21/2022,10.0,isabella chen,30.0,Female,Chinese,Airbnb,900,Airplane,1000.0
125,"Paris, France",126,France,Paris,12/24/2022,1/1/2023,8.0,jack smith,28.0,Male,American,Hostel,400,Airplane,700.0
126,"Bali, Indonesia",127,Indonesia,Bali,2/10/2023,2/18/2023,8.0,katie johnson,33.0,Female,Canadian,Hotel,800,Airplane,800.0
128,"Paris, France",129,France,Paris,5/1/2023,5/7/2023,6.0,john doe,35.0,Male,American,Hotel,5000,Airplane,2500.0
129,"Tokyo, Japan",130,Japan,Tokyo,5/15/2023,5/22/2023,7.0,jane smith,28.0,Female,British,Airbnb,7000,Train,1500.0
130,"Cape Town, South Africa",131,South Africa,Cape Town,6/1/2023,6/10/2023,9.0,michael johnson,45.0,Male,South African,Hostel,3000,Private Car,2000.0
131,"Sydney, Australia",132,Australia,Sydney,6/15/2023,6/21/2023,6.0,sarah lee,31.0,Female,Australian,Hotel,6000,Airplane,3000.0
132,"Rome, Italy",133,Italy,Rome,7/1/2023,7/8/2023,7.0,david kim,42.0,Male,Korean,Airbnb,4000,Train,1500.0
133,"New York City, USA",134,USA,New York City,7/15/2023,7/22/2023,7.0,emily davis,27.0,Female,American,Hotel,8000,Airplane,2500.0
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,8/1/2023,8/10/2023,9.0,jose perez,37.0,Male,Brazilian,Hostel,2500,Private Car,2000.0
135,"Vancouver, Canada",136,Canada,Vancouver,8/15/2023,8/21/2023,6.0,emma wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000.0
136,"Bangkok, Thailand",137,Thailand,Bangkok,9/1/2023,9/8/2023,7.0,ryan chen,34.0,Male,Chinese,Hostel,2000,Train,1000.0
137,"Barcelona, Spain",138,Spain,Barcelona,9/15/2023,9/22/2023,7.0,sofia rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500.0
138,"Auckland, New Zealand",139,New Zealand,Auckland,10/1/2023,10/8/2023,7.0,william brown,39.0,Male,New Zealander,Hotel,7000,Train,2500.0

In [34]:
travel_trip_full_2_df = travel_trip_full_df.copy()
travel_trip_full_2_df

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,"London, UK",1,UK,London,5/1/2023,5/8/2023,7.0,john smith,35.0,Male,American,Hotel,1200,Flight,600.0
1,"Phuket, Thailand",2,Thailand,Phuket,6/15/2023,6/20/2023,5.0,jane doe,28.0,Female,Canadian,Resort,800,Flight,500.0
2,"Bali, Indonesia",3,Indonesia,Bali,7/1/2023,7/8/2023,7.0,david lee,45.0,Male,Korean,Villa,1000,Flight,700.0
3,"New York, USA",4,USA,New York,8/15/2023,8/29/2023,14.0,sarah johnson,29.0,Female,British,Hotel,2000,Flight,1000.0
4,"Tokyo, Japan",5,Japan,Tokyo,9/10/2023,9/17/2023,7.0,kim nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,8/1/2023,8/10/2023,9.0,jose perez,37.0,Male,Brazilian,Hostel,2500,Private Car,2000.0
135,"Vancouver, Canada",136,Canada,Vancouver,8/15/2023,8/21/2023,6.0,emma wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000.0
136,"Bangkok, Thailand",137,Thailand,Bangkok,9/1/2023,9/8/2023,7.0,ryan chen,34.0,Male,Chinese,Hostel,2000,Train,1000.0
137,"Barcelona, Spain",138,Spain,Barcelona,9/15/2023,9/22/2023,7.0,sofia rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500.0
138,"Auckland, New Zealand",139,New Zealand,Auckland,10/1/2023,10/8/2023,7.0,william brown,39.0,Male,New Zealander,Hotel,7000,Train,2500.0

## Safina code

### Cleaning end dates

In [51]:
import pandas as pd

travel_trip_full_2_df["end_date"] = pd.to_datetime(
    travel_trip_full_2_df["end_date"],
    errors="coerce"
)
travel_trip_full_2_df["end_date"] = travel_trip_full_2_df["end_date"].dt.strftime("%Y-%m-%d")

print("All steps completed successfully with the updated file path.")
print(f"DataFrame variable name: travel_trip_full_df")
print(f"Data type of 'end_date': {travel_trip_full_2_df['end_date'].dtype}")
print("\nFirst 5 rows of the converted 'end_date' column:")
print(travel_trip_full_2_df[["end_date"]].head())

All steps completed successfully with the updated file path.
DataFrame variable name: travel_trip_full_df
Data type of 'end_date': object

First 5 rows of the converted 'end_date' column:
     end_date
0  2023-05-08
1  2023-06-20
2  2023-07-08
3  2023-08-29
4  2023-09-17

In [52]:
# Assuming travel_trip_safina_df is loaded and 'end_date' is currently datetime (or has been converted in the steps above).

# Convert the 'end_date' column to datetime first (if not already done)
travel_trip_full_2_df['end_date'] = pd.to_datetime(
    travel_trip_full_2_df['end_date'], 
    errors='coerce'
)

# Use .dt.strftime('%Y-%m') to format the date to Year and Month only.
travel_trip_full_2_df['end_date'] = travel_trip_full_2_df['end_date'].dt.strftime('%Y-%m')

# Optional: Display the new data type and values
print(travel_trip_full_2_df['end_date'])

0      2023-05
1      2023-06
2      2023-07
3      2023-08
4      2023-09
        ...
134    2023-08
135    2023-08
136    2023-09
137    2023-09
138    2023-10
Name: end_date, Length: 137, dtype: object

In [53]:
import pandas as pd 

# 4. CLEAN AND EXTRACT DATE COMPONENTS

# --- Process 'end_date' column ---
# Convert to a clean datetime object
travel_trip_full_2_df['end_date'] = pd.to_datetime(
    travel_trip_full_2_df['end_date'], 
    errors='coerce'
)

# Create the 'end_year' and 'end_month' integer columns
travel_trip_full_2_df['end_year'] = travel_trip_full_2_df['end_date'].dt.year.astype('Int64')
travel_trip_full_2_df['end_month'] = travel_trip_full_2_df['end_date'].dt.month.astype('Int64')


# --- Process 'start_date' column ---
# Convert to a clean datetime object
travel_trip_full_2_df['start_date'] = pd.to_datetime(
    travel_trip_full_2_df['start_date'], 
    errors='coerce'
)

# Create the 'start_year' and 'start_month' integer columns
travel_trip_full_2_df['start_year'] = travel_trip_full_2_df['start_date'].dt.year.astype('Int64')
travel_trip_full_2_df['start_month'] = travel_trip_full_2_df['start_date'].dt.month.astype('Int64')


# 5. DISPLAY VERIFICATION (Optional)
print("Data loading and feature engineering complete.")
print("\nFirst 5 rows of all date columns:")
print(travel_trip_full_2_df[['start_date', 'start_year', 'start_month', 
                              'end_date', 'end_year', 'end_month']].head())

Data loading and feature engineering complete.

First 5 rows of all date columns:
  start_date  start_year  start_month   end_date  end_year  end_month
0 2023-05-01        2023            5 2023-05-01      2023          5
1 2023-06-15        2023            6 2023-06-01      2023          6
2 2023-07-01        2023            7 2023-07-01      2023          7
3 2023-08-15        2023            8 2023-08-01      2023          8
4 2023-09-10        2023            9 2023-09-01      2023          9

In [54]:
import pandas as pd
import numpy as np

# 1. Define the month mapping dictionary
month_map = {
    1: 'January', 2: 'February', 3: 'March', 4: 'April', 
    5: 'May', 6: 'June', 7: 'July', 8: 'August', 
    9: 'September', 10: 'October', 11: 'November', 12: 'December'
}

# 2. Create 'start_month_name' by mapping the integer month to its name
travel_trip_full_2_df['start_month_name'] = travel_trip_full_2_df['start_month'].map(month_map)

# 3. Create 'end_month_name' by mapping the integer month to its name
travel_trip_full_2_df['end_month_name'] = travel_trip_full_2_df['end_month'].map(month_map)

# Optional: Display the first few rows for verification
print(travel_trip_full_2_df[['start_month', 'start_month_name', 'end_month', 'end_month_name']].head())

   start_month start_month_name  end_month end_month_name
0            5              May          5            May
1            6             June          6           June
2            7             July          7           July
3            8           August          8         August
4            9        September          9      September

In [55]:
print(travel_trip_full_2_df[['start_year', 'start_month_name', 'end_year', 'end_month_name']].head())

   start_year start_month_name  end_year end_month_name
0        2023              May      2023            May
1        2023             June      2023           June
2        2023             July      2023           July
3        2023           August      2023         August
4        2023        September      2023      September

In [56]:
travel_trip_full_2_df

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,...,accommodation_type,accommodation_cost,transportation_type,transportation_cost,end_year,end_month,start_year,start_month,start_month_name,end_month_name
0,"London, UK",1,UK,London,2023-05-01,2023-05-01,7.0,john smith,35.0,Male,...,Hotel,1200,Flight,600.0,2023,5,2023,5,May,May
1,"Phuket, Thailand",2,Thailand,Phuket,2023-06-15,2023-06-01,5.0,jane doe,28.0,Female,...,Resort,800,Flight,500.0,2023,6,2023,6,June,June
2,"Bali, Indonesia",3,Indonesia,Bali,2023-07-01,2023-07-01,7.0,david lee,45.0,Male,...,Villa,1000,Flight,700.0,2023,7,2023,7,July,July
3,"New York, USA",4,USA,New York,2023-08-15,2023-08-01,14.0,sarah johnson,29.0,Female,...,Hotel,2000,Flight,1000.0,2023,8,2023,8,August,August
4,"Tokyo, Japan",5,Japan,Tokyo,2023-09-10,2023-09-01,7.0,kim nguyen,26.0,Female,...,Airbnb,700,Train,200.0,2023,9,2023,9,September,September
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,2023-08-01,2023-08-01,9.0,jose perez,37.0,Male,...,Hostel,2500,Private Car,2000.0,2023,8,2023,8,August,August
135,"Vancouver, Canada",136,Canada,Vancouver,2023-08-15,2023-08-01,6.0,emma wilson,29.0,Female,...,Hotel,5000,Airplane,3000.0,2023,8,2023,8,August,August
136,"Bangkok, Thailand",137,Thailand,Bangkok,2023-09-01,2023-09-01,7.0,ryan chen,34.0,Male,...,Hostel,2000,Train,1000.0,2023,9,2023,9,September,September
137,"Barcelona, Spain",138,Spain,Barcelona,2023-09-15,2023-09-01,7.0,sofia rodriguez,25.0,Female,...,Airbnb,6000,Airplane,2500.0,2023,9,2023,9,September,September
138,"Auckland, New Zealand",139,New Zealand,Auckland,2023-10-01,2023-10-01,7.0,william brown,39.0,Male,...,Hotel,7000,Train,2500.0,2023,10,2023,10,October,October

In [57]:
travel_trip_dull_3_df = travel_trip_full_2_df.copy()

In [58]:
travel_trip_dull_3_df

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,...,accommodation_type,accommodation_cost,transportation_type,transportation_cost,end_year,end_month,start_year,start_month,start_month_name,end_month_name
0,"London, UK",1,UK,London,2023-05-01,2023-05-01,7.0,john smith,35.0,Male,...,Hotel,1200,Flight,600.0,2023,5,2023,5,May,May
1,"Phuket, Thailand",2,Thailand,Phuket,2023-06-15,2023-06-01,5.0,jane doe,28.0,Female,...,Resort,800,Flight,500.0,2023,6,2023,6,June,June
2,"Bali, Indonesia",3,Indonesia,Bali,2023-07-01,2023-07-01,7.0,david lee,45.0,Male,...,Villa,1000,Flight,700.0,2023,7,2023,7,July,July
3,"New York, USA",4,USA,New York,2023-08-15,2023-08-01,14.0,sarah johnson,29.0,Female,...,Hotel,2000,Flight,1000.0,2023,8,2023,8,August,August
4,"Tokyo, Japan",5,Japan,Tokyo,2023-09-10,2023-09-01,7.0,kim nguyen,26.0,Female,...,Airbnb,700,Train,200.0,2023,9,2023,9,September,September
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,2023-08-01,2023-08-01,9.0,jose perez,37.0,Male,...,Hostel,2500,Private Car,2000.0,2023,8,2023,8,August,August
135,"Vancouver, Canada",136,Canada,Vancouver,2023-08-15,2023-08-01,6.0,emma wilson,29.0,Female,...,Hotel,5000,Airplane,3000.0,2023,8,2023,8,August,August
136,"Bangkok, Thailand",137,Thailand,Bangkok,2023-09-01,2023-09-01,7.0,ryan chen,34.0,Male,...,Hostel,2000,Train,1000.0,2023,9,2023,9,September,September
137,"Barcelona, Spain",138,Spain,Barcelona,2023-09-15,2023-09-01,7.0,sofia rodriguez,25.0,Female,...,Airbnb,6000,Airplane,2500.0,2023,9,2023,9,September,September
138,"Auckland, New Zealand",139,New Zealand,Auckland,2023-10-01,2023-10-01,7.0,william brown,39.0,Male,...,Hotel,7000,Train,2500.0,2023,10,2023,10,October,October

## Hoaithuong code

### Cleaning starting date

In [59]:
travel_trip_dull_3_df['start_date'].unique()
#extract the list of unique values

<DatetimeArray>
['2023-05-01 00:00:00', '2023-06-15 00:00:00', '2023-07-01 00:00:00',
 '2023-08-15 00:00:00', '2023-09-10 00:00:00', '2023-10-05 00:00:00',
 '2023-11-20 00:00:00', '2024-01-05 00:00:00', '2024-02-14 00:00:00',
 '2024-03-10 00:00:00',
 ...
 '2022-08-08 00:00:00', '2022-09-20 00:00:00', '2022-10-05 00:00:00',
 '2022-11-11 00:00:00', '2022-12-24 00:00:00', '2023-02-10 00:00:00',
 '2023-05-15 00:00:00', '2023-06-01 00:00:00', '2023-07-15 00:00:00',
 '2023-10-01 00:00:00']
Length: 111, dtype: datetime64[ns]

In [60]:
travel_trip_dull_3_df[travel_trip_dull_3_df['start_date'].isna()]

Empty DataFrame
Columns: [destination, trip_id, destination_country, destination_city, start_date, end_date, duration_days, traveler_name, traveler_age, traveler_gender, traveler_nationality, accommodation_type, accommodation_cost, transportation_type, transportation_cost, end_year, end_month, start_year, start_month, start_month_name, end_month_name]
Index: []

[0 rows x 21 columns]

In [61]:
travel_trip_dull_3_df["start_date"].isna().sum()

np.int64(0)

In [62]:
travel_trip_dull_3_df["start_date"].nunique()

111

In [63]:
travel_trip_dull_3_df['start_date'] = pd.to_datetime(travel_trip_dull_3_df['start_date'], format='%m/%d/%Y')
print(travel_trip_dull_3_df['start_date'])

0     2023-05-01
1     2023-06-15
2     2023-07-01
3     2023-08-15
4     2023-09-10
         ...
134   2023-08-01
135   2023-08-15
136   2023-09-01
137   2023-09-15
138   2023-10-01
Name: start_date, Length: 137, dtype: datetime64[ns]

In [64]:
# Convert the 'end_date' column to datetime first (if not already done)
travel_trip_dull_3_df['start_date'] = pd.to_datetime(
    travel_trip_dull_3_df['start_date'], 
    errors='coerce'
)

# Use .dt.strftime('%Y-%m') to format the date to Year and Month only.
travel_trip_dull_3_df['start_date'] = travel_trip_dull_3_df['start_date'].dt.strftime('%Y-%m')

# Optional: Display the new data type and values
print(travel_trip_dull_3_df[['start_date']].head())

  start_date
0    2023-05
1    2023-06
2    2023-07
3    2023-08
4    2023-09

In [65]:
travel_trip_dull_3_df['start_date'] = pd.to_datetime(travel_trip_dull_3_df['start_date'], errors='coerce')
travel_trip_dull_3_df['start_date']

0     2023-05-01
1     2023-06-01
2     2023-07-01
3     2023-08-01
4     2023-09-01
         ...
134   2023-08-01
135   2023-08-01
136   2023-09-01
137   2023-09-01
138   2023-10-01
Name: start_date, Length: 137, dtype: datetime64[ns]

In [50]:
travel_trip_dull_3_df['start_month'] = travel_trip_dull_3_df['start_date'].dt.strftime('%B')
travel_trip_dull_3_df['start_month']

0            May
1           June
2           July
3         August
4      September
         ...
134       August
135       August
136    September
137    September
138      October
Name: start_month, Length: 137, dtype: object

In [66]:
travel_trip_dull_3_df["start_date"] = pd.to_datetime(
    travel_trip_dull_3_df["start_date"], errors="coerce"
)

travel_trip_dull_3_df["start_year"] = (
    travel_trip_dull_3_df["start_date"].dt.year.astype("Int64")
)
travel_trip_dull_3_df.head()

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,...,accommodation_type,accommodation_cost,transportation_type,transportation_cost,end_year,end_month,start_year,start_month,start_month_name,end_month_name
0,"London, UK",1,UK,London,2023-05-01,2023-05-01,7.0,john smith,35.0,Male,...,Hotel,1200,Flight,600.0,2023,5,2023,5,May,May
1,"Phuket, Thailand",2,Thailand,Phuket,2023-06-01,2023-06-01,5.0,jane doe,28.0,Female,...,Resort,800,Flight,500.0,2023,6,2023,6,June,June
2,"Bali, Indonesia",3,Indonesia,Bali,2023-07-01,2023-07-01,7.0,david lee,45.0,Male,...,Villa,1000,Flight,700.0,2023,7,2023,7,July,July
3,"New York, USA",4,USA,New York,2023-08-01,2023-08-01,14.0,sarah johnson,29.0,Female,...,Hotel,2000,Flight,1000.0,2023,8,2023,8,August,August
4,"Tokyo, Japan",5,Japan,Tokyo,2023-09-01,2023-09-01,7.0,kim nguyen,26.0,Female,...,Airbnb,700,Train,200.0,2023,9,2023,9,September,September

### Clean columns: traveler_nationality

In [67]:
travel_trip_dull_3_df['traveler_nationality'].str.strip().str.lower().str.title()

0           American
1           Canadian
2             Korean
3            British
4         Vietnamese
           ...
134        Brazilian
135         Canadian
136          Chinese
137          Spanish
138    New Zealander
Name: traveler_nationality, Length: 137, dtype: object

In [68]:
travel_trip_dull_3_df['traveler_nationality'].value_counts()

traveler_nationality
American                24
Korean                  13
British                 12
Canadian                 9
Australian               8
Chinese                  7
Spanish                  7
Brazilian                4
Italian                  4
Indian                   4
South Korean             3
Vietnamese               3
South Korea              3
Emirati                  2
Dutch                    2
Japanese                 2
South African            2
USA                      2
Canada                   2
Taiwan                   2
Mexican                  2
Moroccan                 1
French                   1
German                   1
Scottish                 1
Taiwanese                1
Indonesian               1
UK                       1
China                    1
Japan                    1
Spain                    1
Brazil                   1
Germany                  1
Hong Kong                1
United Kingdom           1
Singapore                1
Italy                    1
Greece                   1
United Arab Emirates     1
Cambodia                 1
New Zealander            1
Name: count, dtype: int64

In [69]:
mapping = {
    'American': 'United States',
    'USA': 'United States',
    'Canada': 'Canada',
    'Canadian': 'Canada',
    'UK': 'United Kingdom',
    'United Kingdom': 'United Kingdom',
    'British': 'United Kingdom',
    'Scottish': 'United Kingdom',
    'Korean': 'South Korea',
    'South Korea': 'South Korea',
    'South Korean': 'South Korea',
    'China': 'China',
    'Chinese': 'China',
    'Italy': 'Italy',
    'Italian': 'Italy',
    'Brazil': 'Brazil',
    'Brazilian': 'Brazil',
    'Emirati': 'United Arab Emirates',
    'United Arab Emirates': 'United Arab Emirates',
    'Taiwan': 'Taiwan',
    'Taiwanese': 'Taiwan',
    'Germany': 'Germany',
    'German': 'Germany',
    'Spain': 'Spain',
    'Spanish': 'Spain',
    'Japan': 'Japan',
    'Japanese': 'Japan'
}

travel_trip_dull_3_df['traveler_nationality_clean'] = travel_trip_dull_3_df['traveler_nationality'].replace(mapping)

In [70]:
travel_trip_dull_3_df['traveler_nationality_clean'].value_counts()

traveler_nationality_clean
United States           26
South Korea             19
United Kingdom          15
Canada                  11
Australian               8
Spain                    8
China                    8
Italy                    5
Brazil                   5
Indian                   4
Japan                    3
Taiwan                   3
United Arab Emirates     3
Vietnamese               3
Mexican                  2
Dutch                    2
South African            2
Germany                  2
French                   1
Moroccan                 1
Indonesian               1
Hong Kong                1
Singapore                1
Greece                   1
Cambodia                 1
New Zealander            1
Name: count, dtype: int64

In [71]:
travel_trip_dull_3_df['traveler_nationality'].dtype

dtype('O')

In [72]:
travel_trip_dull_3_df['traveler_nationality'].astype('string')

0           American
1           Canadian
2             Korean
3            British
4         Vietnamese
           ...
134        Brazilian
135         Canadian
136          Chinese
137          Spanish
138    New Zealander
Name: traveler_nationality, Length: 137, dtype: string

In [74]:
travel_trip_dull_3_df['traveler_nationality'].isna().sum()

np.int64(0)

### Cleaning the column traveler_gender

In [75]:
travel_trip_dull_3_df['traveler_gender'].unique()

array(['Male', 'Female'], dtype=object)

In [76]:
travel_trip_dull_3_df['traveler_gender'].value_counts()

traveler_gender
Female    70
Male      67
Name: count, dtype: int64

In [77]:
travel_trip_dull_3_df["traveler_gender"] = (
    travel_trip_dull_3_df["traveler_gender"].fillna("Unknown")
)
travel_trip_dull_3_df['traveler_gender'].value_counts()

traveler_gender
Female    70
Male      67
Name: count, dtype: int64

### Clean columns accommodation_type

In [78]:
travel_trip_dull_3_df['accommodation_type'].unique()

array(['Hotel', 'Resort', 'Villa', 'Airbnb', 'Hostel', 'Riad',
       'Vacation rental', 'Guesthouse'], dtype=object)

In [79]:
travel_trip_dull_3_df['accommodation_type'] = travel_trip_dull_3_df['accommodation_type'].fillna('Unknown')
travel_trip_dull_3_df['accommodation_type'].value_counts()

accommodation_type
Hotel              60
Airbnb             30
Hostel             24
Resort             14
Villa               4
Vacation rental     3
Riad                1
Guesthouse          1
Name: count, dtype: int64

In [80]:
mapping = {
    'Riad': 'Villa',
    'Guesthouse': 'Vacation rental'
}
travel_trip_dull_3_df['accommodation_type'] = travel_trip_dull_3_df['accommodation_type'].replace(mapping)

In [81]:
travel_trip_dull_3_df['accommodation_type'].value_counts()

accommodation_type
Hotel              60
Airbnb             30
Hostel             24
Resort             14
Villa               5
Vacation rental     4
Name: count, dtype: int64

### Clean columns accommodation_cost

In [82]:
travel_trip_dull_3_df['accommodation_cost'].describe()

count      137
unique      53
top       1200
freq         7
Name: accommodation_cost, dtype: object

In [85]:
travel_trip_dull_3_df.loc[:, "accommodation_cost"] = (
    travel_trip_dull_3_df["accommodation_cost"]
        .astype(str)                      # in case there are numbers/NaN in there
        .str.strip()
        .str.strip("$")
        .str.replace(",", "", regex=False)
        .str.replace(" USD", "", regex=False)
        .str.strip()
)

travel_trip_dull_3_df.loc[:, "accommodation_cost"] = pd.to_numeric(
    travel_trip_dull_3_df["accommodation_cost"],
    errors="coerce"
)

travel_trip_dull_3_df.accommodation_cost.unique()

array([1200, 800, 1000, 2000, 700, 1500, 500, 900, 2500, 3000, 1400, 600,
       400, 1100, 200, 150, 180, 350, 2200, 300, 1300, 1800, 100, 5000,
       7000, 6000, 4000, 8000], dtype=object)

In [86]:
median_cost = travel_trip_dull_3_df['accommodation_cost'].median()
travel_trip_dull_3_df['accommodation_cost'] = travel_trip_dull_3_df['accommodation_cost'].fillna(median_cost)
travel_trip_dull_3_df['accommodation_cost']
travel_trip_dull_3_df

/var/folders/13/s00136yd6q5bvv6x74_x_m204g4004/T/ipykernel_39449/2161018080.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  travel_trip_dull_3_df['accommodation_cost'] = travel_trip_dull_3_df['accommodation_cost'].fillna(median_cost)

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,...,accommodation_cost,transportation_type,transportation_cost,end_year,end_month,start_year,start_month,start_month_name,end_month_name,traveler_nationality_clean
0,"London, UK",1,UK,London,2023-05-01,2023-05-01,7.0,john smith,35.0,Male,...,1200,Flight,600.0,2023,5,2023,5,May,May,United States
1,"Phuket, Thailand",2,Thailand,Phuket,2023-06-01,2023-06-01,5.0,jane doe,28.0,Female,...,800,Flight,500.0,2023,6,2023,6,June,June,Canada
2,"Bali, Indonesia",3,Indonesia,Bali,2023-07-01,2023-07-01,7.0,david lee,45.0,Male,...,1000,Flight,700.0,2023,7,2023,7,July,July,South Korea
3,"New York, USA",4,USA,New York,2023-08-01,2023-08-01,14.0,sarah johnson,29.0,Female,...,2000,Flight,1000.0,2023,8,2023,8,August,August,United Kingdom
4,"Tokyo, Japan",5,Japan,Tokyo,2023-09-01,2023-09-01,7.0,kim nguyen,26.0,Female,...,700,Train,200.0,2023,9,2023,9,September,September,Vietnamese
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,2023-08-01,2023-08-01,9.0,jose perez,37.0,Male,...,2500,Private Car,2000.0,2023,8,2023,8,August,August,Brazil
135,"Vancouver, Canada",136,Canada,Vancouver,2023-08-01,2023-08-01,6.0,emma wilson,29.0,Female,...,5000,Airplane,3000.0,2023,8,2023,8,August,August,Canada
136,"Bangkok, Thailand",137,Thailand,Bangkok,2023-09-01,2023-09-01,7.0,ryan chen,34.0,Male,...,2000,Train,1000.0,2023,9,2023,9,September,September,China
137,"Barcelona, Spain",138,Spain,Barcelona,2023-09-01,2023-09-01,7.0,sofia rodriguez,25.0,Female,...,6000,Airplane,2500.0,2023,9,2023,9,September,September,Spain
138,"Auckland, New Zealand",139,New Zealand,Auckland,2023-10-01,2023-10-01,7.0,william brown,39.0,Male,...,7000,Train,2500.0,2023,10,2023,10,October,October,New Zealander

In [89]:
travel_trip_dull_3_df.accommodation_cost.isnull().sum()

np.int64(0)

In [90]:
travel_trip_complete_df = travel_trip_dull_3_df.copy()

# Our clean dataframe to do the analysis

In [91]:
travel_trip_complete_df

,destination,trip_id,destination_country,destination_city,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,...,accommodation_cost,transportation_type,transportation_cost,end_year,end_month,start_year,start_month,start_month_name,end_month_name,traveler_nationality_clean
0,"London, UK",1,UK,London,2023-05-01,2023-05-01,7.0,john smith,35.0,Male,...,1200,Flight,600.0,2023,5,2023,5,May,May,United States
1,"Phuket, Thailand",2,Thailand,Phuket,2023-06-01,2023-06-01,5.0,jane doe,28.0,Female,...,800,Flight,500.0,2023,6,2023,6,June,June,Canada
2,"Bali, Indonesia",3,Indonesia,Bali,2023-07-01,2023-07-01,7.0,david lee,45.0,Male,...,1000,Flight,700.0,2023,7,2023,7,July,July,South Korea
3,"New York, USA",4,USA,New York,2023-08-01,2023-08-01,14.0,sarah johnson,29.0,Female,...,2000,Flight,1000.0,2023,8,2023,8,August,August,United Kingdom
4,"Tokyo, Japan",5,Japan,Tokyo,2023-09-01,2023-09-01,7.0,kim nguyen,26.0,Female,...,700,Train,200.0,2023,9,2023,9,September,September,Vietnamese
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,"Rio de Janeiro, Brazil",135,Brazil,Rio de Janeiro,2023-08-01,2023-08-01,9.0,jose perez,37.0,Male,...,2500,Private Car,2000.0,2023,8,2023,8,August,August,Brazil
135,"Vancouver, Canada",136,Canada,Vancouver,2023-08-01,2023-08-01,6.0,emma wilson,29.0,Female,...,5000,Airplane,3000.0,2023,8,2023,8,August,August,Canada
136,"Bangkok, Thailand",137,Thailand,Bangkok,2023-09-01,2023-09-01,7.0,ryan chen,34.0,Male,...,2000,Train,1000.0,2023,9,2023,9,September,September,China
137,"Barcelona, Spain",138,Spain,Barcelona,2023-09-01,2023-09-01,7.0,sofia rodriguez,25.0,Female,...,6000,Airplane,2500.0,2023,9,2023,9,September,September,Spain
138,"Auckland, New Zealand",139,New Zealand,Auckland,2023-10-01,2023-10-01,7.0,william brown,39.0,Male,...,7000,Train,2500.0,2023,10,2023,10,October,October,New Zealander

In [93]:
import os
os.makedirs("../data/clean", exist_ok=True)

# 1) Human / sharing version
travel_trip_complete_df.to_csv("../data/clean/travel_trip_complete.csv", index=False)

# 2) Analysis version (keeps dtypes)
travel_trip_complete_df.to_parquet("../data/clean/travel_trip_complete.parquet", index=False)
# or:
# travel_trip_complete_df.to_pickle("../data/processed/travel_trip_complete.pkl")